{
  "about": "This website was created as part of the COMP6841 Something Awesome Project. The purpose of my project is to educate the general public about Cryptography specifically. However, it has grown from solely focusing on cryptography to be more of a catch-all for common CTF challenges. In my project, I have completed several CTF challenges ranging from low to high level and written up my process in extensive detail. Additionally, I have created similar examples of these challenges as well as tools that can be used for solving.",
  "ctfExplanation": "Capture the flag (CTF) challenges are common exercises in computer security where a program is purposefully vulnerable to allow the challenge participant to find exploits and recover the 'flag' text string. The term comes from the playground sport of the same name. Much like this entire project, CTF challenges are educational and offer hands-on technical applications of concepts learned.",
  "krypton" : "The Krypton CTF challenges on OverTheWire are used to gain familiarity and introduce oneself to common CTF tools and procedures. This is an introductory hands-on experience that builds skills and confidence before I move on to HackTheBox CTF challenges. This writeup and guide is not meant to spoil the learning experience for anyone else interested in these wargames challenges. This is a warning that the following content will analyse and describe aspects of the challenges as well as my approach and how I 'captured the flag'. OverTheWire wargames are levelled and require the password from solving one level to progress to the next level. This is why the level names are portrayed as Level n - Level n + 1 as solving each of these sends you to the next problem. The games are accessible via SSH where the flag is the password to log in. More details for how these games work can be found in OverTheWire's introductory wargame, Bandit.",
  "htb" : "HackTheBox is a platform with a multitude of services, including hosting CTF challenges. The challenges in these writeups are part of the perpetually ongoing 'Try Out' CTF event. In walkthorughs, where applicable, speicifc urls are never specified since these are launched via docker uniquely when someone starts a challenge. Instead, to indicate the start of the url, 'host:port/' is used.",
  "research" : {
    "about" : "Cryptography (also known as cryptology) is the science and art of securing communication and information by transforming it into a format that is unreadable to unauthorized users. The word itself comes from Ancient Greek 'κρυπτός', romanised as 'kryptós', 'γράφειν', romanised as 'graphein', and 'λογία', romanised as '-logia', with each word respectively meaning 'hidden, secret', 'to write', and 'to study'. So basically it means the study of writing secrets (or hiding writing). Its primary purpose is to ensure confidentiality, integrity, authentication, and non-repudiation of data. By using cryptographic techniques, sensitive information can be protected from eavesdroppers, hackers, and other malicious entities. It is widely used in modern day security with algorithms and technology allowing obsuration and complexity to grow to heights never seen before. However, it's origins go back centuries and can be seen in countless cases scattered across history. Humans have always been social, making secrets and information difficult to keep hidden, so the ever inventive mind has been creating ways to conceal long before we had computers to automate our processes.",
    "history": ""
  }
}